{"home":{"content":"# Lecture 0: Homework\n---\n**DUE DATE:** Wednesday July 6th, 6:30PM.\n\n\nYour objective for this assignment is to get comfortable with HTML tags and the process for pushing your webpage to the internet via GitHub. \n\n## Assignment\n---\nFor your first assignment, please create a simple resume page using the HTML tags we learned about in class.\n\n#### Part one\n---\nCreate a new repo on [GitHub](https://github.com/). Call it **resume**. (All lower case, no caps).\n\nCreate a simple HTML page like we did in class with a sentence or two and **commit** it to your GitHub using the technique we covered in class. Don't forget to add a meaningful commit message!\n\n**NOTE** When we grade this assignment, we will look for this initial commit\n\n#### Part two\n---\n\nUpdate the code you added to the HTML page you created in **Part One** and build out a resume (it can be your real resume OR a fake thing you make up).\n\nYou should add your HTML tags in sections (and after each section, you are expected to **commit** your code to GitHub). We'll look for at least **three** commits to your GitHub repo including the initial commit from **Part One**.\n\nYou may use [this example](http://resume.taqquikarim.com/) as a template.\n\n**NOTE:** we did not learn how to center the content in a constrained width, so don't expect to make this work for your resume. \n\n**NOTE:** Also, we did not cover CSS yet, so do not feel obligated to use it (in fact, most of you should not even know what it is!). If, however, you have experience writing CSS, then by all means please go ahead.\n\nIn general, we learned about **most** of the tags that you should need to make a standard resume. There are a few tags (ie: how do we make italic text? Bold text?) that we did not cover in class &mdash; you are expected to use **the google** to find out what those tags are. (This will help you understand how google plays into the web development process).\n\n### Submission Guidelines\n---\n\n1. Once you are happy with your resume, please push it to [GitBot](http://gitbot.co).\n2. Remember to give GitBot a few minutes to upload your site to its servers!\n3. **DON'T DO THIS YET**: DM the **myclassbot** bot in slack with the url of your website (the one that GitBot generates).\n4. ???\n5. Profit.\n\n**myclassbot** is **almost** done. I just need to set him up to reply to you back once we are done grading. Should be ready by the weekend.\n\n#### Additional Reading\n---\nThe following resources might be helpful in doing your homework.\n\n1. [HTML Reference](http://www.w3schools.com/tags/)\n2. [HTML Lists](http://www.w3schools.com/html/html_lists.asp)\n3. [HTML Links](http://www.w3schools.com/html/html_links.asp)\n4. [Special Characters in HTML](http://symbolcodes.tlt.psu.edu/web/codehtml.html) (ie: degree symbols, ampersands, etc).\n5. **[Sublime Text Tricks](http://code.tutsplus.com/tutorials/sublime-text-2-tips-and-tricks-updated--net-21519)**\n6. [HTML Validator](https://validator.w3.org/#validate_by_input) (is your HTML \"correct\"? Paste your code in here to find out!)\n ","idx":0},"title":{"content":"Lecture 0: Homework","idx":1},"desc":{"content":"Create a simple resume page using the HTML tags we learned about in class","idx":2},"__list__":["home","title","desc"]}